# vsoCanEditParam

## Description
Inticated whether a parameter can edited by a worksheet

```pascal
PROCEDURE vsoCanEditParam(canEditParam : BOOLEAN);
```

```python

def vs.vsoCanEditParam(canEditParam):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|canEditParam|BOOLEAN||

## Version
Availability: from Vectorworks 2017
## Category
* Object Events